HasflarSonto/pipecat/esp32-luna/sdkconfig.defaults
# ESP32-Luna SDK Configuration Defaults
# Target: ESP32-S3-Touch-AMOLED-2.06 (Waveshare)

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Flash size (32MB)
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (8MB)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32

# LWIP
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_RCVBUF=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072

# Main task stack (need extra for LVGL widget creation)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# WebSocket
CONFIG_ESP_WEBSOCKET_CLIENT_ENABLE=y

# LVGL
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=y

# LVGL Theme - disable default theme to prevent color artifacts
CONFIG_LV_USE_THEME_DEFAULT=n
CONFIG_LV_THEME_DEFAULT_DARK=n

# LVGL Fonts (for text, clock, subway display modes)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# BSP Display - Buffer size limited by SPI DMA (~160KB max per transfer)
# Screen is 502x410, RGB565 (2 bytes/pixel)
# Buffer = 502 * 150 * 2 = 150KB (safe for SPI, under 160KB limit)
# LVGL will render the full display in multiple passes
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=150

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
